; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v6 ?v13)
             (pred_5 ?v12 ?v7)
             (pred_1 ?v6 ?v7)
             (pred_3 ?v11 ?v6 )
	     (pred_6 ?v6)
             (pred_9 ?v10)
             (pred_12 ?v12)
             (pred_11 ?v7)
             (pred_7 ?v6)
             (pred_2 ?v12)
             (pred_10 ?v6)
             (pred_4 ))



(:action op_2
:parameters (?v1 ?v5 ?v9 ?v3)
:precondition (and (pred_9 ?v1) (pred_9 ?v5) (pred_12 ?v9) (pred_11 ?v3)
          (pred_8 ?v1 ?v5) (pred_5 ?v9 ?v3)
                   (pred_1 ?v5 ?v3) (pred_6 ?v1) 
                   (pred_7 ?v5) (pred_2 ?v9))
:effect (and  (pred_10 ?v5) (not (pred_7 ?v5))))


(:action op_4
:parameters (?v1 ?v2)
:precondition (and (pred_9 ?v1) (pred_9 ?v2)
               (pred_6 ?v1) (pred_8 ?v1 ?v2) (pred_10 ?v2))
:effect (and (pred_6 ?v2) (not (pred_6 ?v1))))

(:action op_5
:parameters (?v1 ?v9)
:precondition (and (pred_9 ?v1) (pred_12 ?v9) 
                  (pred_6 ?v1) (pred_3 ?v9 ?v1) (pred_4 ))
:effect (and (pred_2 ?v9)
   (not (pred_3 ?v9 ?v1)) (not (pred_4 ))))


(:action op_3
:parameters (?v1 ?v8 ?v4)
:precondition (and (pred_9 ?v1) (pred_12 ?v8) (pred_12 ?v4)
                  (pred_6 ?v1) (pred_2 ?v4) (pred_3 ?v8 ?v1))
:effect (and (pred_2 ?v8) (pred_3 ?v4 ?v1)
        (not (pred_2 ?v4)) (not (pred_3 ?v8 ?v1))))

(:action op_1
:parameters (?v1 ?v9)
:precondition (and (pred_9 ?v1) (pred_12 ?v9) 
                  (pred_6 ?v1) (pred_2 ?v9))
:effect (and (pred_4 ) (pred_3 ?v9 ?v1) (not (pred_2 ?v9)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_07 obj_22 obj_15 obj_16 obj_01 obj_10 obj_06 obj_20 obj_03 obj_02 obj_14 obj_09 obj_12 obj_11 obj_18 obj_04
    obj_08 obj_21 obj_17
    obj_13 obj_19 obj_05
    )

    (:init
       (pred_4)

       (pred_9 obj_07)
       (pred_9 obj_22)
       (pred_9 obj_15)
       (pred_9 obj_16)
       (pred_9 obj_01)
       (pred_9 obj_10)
       (pred_9 obj_06)
       (pred_9 obj_20)
       (pred_9 obj_03)
       (pred_9 obj_02)
       (pred_9 obj_14)
       (pred_9 obj_09)
       (pred_9 obj_12)
       (pred_9 obj_11)
       (pred_9 obj_18)
       (pred_9 obj_04)
       (pred_11 obj_08)
       (pred_11 obj_21)
       (pred_11 obj_17)
       (pred_12 obj_13)
       (pred_12 obj_19)
       (pred_12 obj_05)

       (pred_8 obj_07 obj_01)
       (pred_8 obj_07 obj_22)
       (pred_8 obj_22 obj_10)
       (pred_8 obj_22 obj_15)
       (pred_8 obj_22 obj_07)
       (pred_8 obj_15 obj_06)
       (pred_8 obj_15 obj_16)
       (pred_8 obj_15 obj_22)
       (pred_8 obj_16 obj_20)
       (pred_8 obj_16 obj_15)
       (pred_8 obj_01 obj_03)
       (pred_8 obj_01 obj_10)
       (pred_8 obj_01 obj_07)
       (pred_8 obj_10 obj_02)
       (pred_8 obj_10 obj_06)
       (pred_8 obj_10 obj_22)
       (pred_8 obj_10 obj_01)
       (pred_8 obj_06 obj_14)
       (pred_8 obj_06 obj_20)
       (pred_8 obj_06 obj_15)
       (pred_8 obj_06 obj_10)
       (pred_8 obj_20 obj_09)
       (pred_8 obj_20 obj_16)
       (pred_8 obj_20 obj_06)
       (pred_8 obj_03 obj_12)
       (pred_8 obj_03 obj_02)
       (pred_8 obj_03 obj_01)
       (pred_8 obj_02 obj_11)
       (pred_8 obj_02 obj_14)
       (pred_8 obj_02 obj_10)
       (pred_8 obj_02 obj_03)
       (pred_8 obj_14 obj_18)
       (pred_8 obj_14 obj_09)
       (pred_8 obj_14 obj_06)
       (pred_8 obj_14 obj_02)
       (pred_8 obj_09 obj_04)
       (pred_8 obj_09 obj_20)
       (pred_8 obj_09 obj_14)
       (pred_8 obj_12 obj_11)
       (pred_8 obj_12 obj_03)
       (pred_8 obj_11 obj_18)
       (pred_8 obj_11 obj_02)
       (pred_8 obj_11 obj_12)
       (pred_8 obj_18 obj_04)
       (pred_8 obj_18 obj_14)
       (pred_8 obj_18 obj_11)
       (pred_8 obj_04 obj_09)
       (pred_8 obj_04 obj_18)
       (pred_7 obj_22)
       (pred_7 obj_20)
       (pred_7 obj_16)
       (pred_1  obj_22 obj_08)
       (pred_1  obj_20 obj_21)
       (pred_1  obj_16 obj_17)
       (pred_10 obj_07)
       (pred_10 obj_15)
       (pred_10 obj_01)
       (pred_10 obj_10)
       (pred_10 obj_06)
       (pred_10 obj_03)
       (pred_10 obj_02)
       (pred_10 obj_14)
       (pred_10 obj_09)
       (pred_10 obj_12)
       (pred_10 obj_11)
       (pred_10 obj_18)
       (pred_10 obj_04)

       (pred_5  obj_13 obj_08)
       (pred_5  obj_19 obj_21)
       (pred_5  obj_05 obj_17)
       (pred_3 obj_13 obj_15)
       (pred_3 obj_19 obj_09)
       (pred_3 obj_05 obj_09)
       (pred_6 obj_11)
    )

    (:goal (and
       (pred_3 obj_13 obj_22)
       (pred_3 obj_19 obj_03)
       (pred_3 obj_05 obj_02)
    ))
(:constraints
  (always (not (pred_6 obj_14)))
)
)

; plan
1. (op_4 obj_11 obj_18)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_18)
   goals met: 0 of 3
2. (op_4 obj_18 obj_04)
   deleted: (pred_6 obj_18)
   added: (pred_6 obj_04)
   goals met: 0 of 3
3. (op_4 obj_04 obj_09)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_09)
   goals met: 0 of 3
4. (op_5 obj_09 obj_19)
   deleted: (pred_3 obj_19 obj_09) (pred_4)
   added: (pred_2 obj_19)
   goals met: 0 of 3
5. (op_2 obj_09 obj_20 obj_19 obj_21)
   deleted: (pred_7 obj_20)
   added: (pred_10 obj_20)
   goals met: 0 of 3
6. (op_4 obj_09 obj_20)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_20)
   goals met: 0 of 3
7. (op_1 obj_20 obj_19)
   deleted: (pred_2 obj_19)
   added: (pred_4) (pred_3 obj_19 obj_20)
   goals met: 0 of 3
8. (op_4 obj_20 obj_09)
   deleted: (pred_6 obj_20)
   added: (pred_6 obj_09)
   goals met: 0 of 3
9. (op_5 obj_09 obj_05)
   deleted: (pred_3 obj_05 obj_09) (pred_4)
   added: (pred_2 obj_05)
   goals met: 0 of 3
10. (op_4 obj_09 obj_20)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_20)
   goals met: 0 of 3
11. (op_4 obj_20 obj_06)
   deleted: (pred_6 obj_20)
   added: (pred_6 obj_06)
   goals met: 0 of 3
12. (op_4 obj_06 obj_15)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_15)
   goals met: 0 of 3
13. (op_3 obj_15 obj_13 obj_05)
   deleted: (pred_2 obj_05) (pred_3 obj_13 obj_15)
   added: (pred_2 obj_13) (pred_3 obj_05 obj_15)
   goals met: 0 of 3
14. (op_2 obj_15 obj_22 obj_13 obj_08)
   deleted: (pred_7 obj_22)
   added: (pred_10 obj_22)
   goals met: 0 of 3
15. (op_4 obj_15 obj_06)
   deleted: (pred_6 obj_15)
   added: (pred_6 obj_06)
   goals met: 0 of 3
16. (op_1 obj_06 obj_13)
   deleted: (pred_2 obj_13)
   added: (pred_4) (pred_3 obj_13 obj_06)
   goals met: 0 of 3
17. (op_4 obj_06 obj_20)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_20)
   goals met: 0 of 3
18. (op_5 obj_20 obj_19)
   deleted: (pred_3 obj_19 obj_20) (pred_4)
   added: (pred_2 obj_19)
   goals met: 0 of 3
19. (op_4 obj_20 obj_06)
   deleted: (pred_6 obj_20)
   added: (pred_6 obj_06)
   goals met: 0 of 3
20. (op_3 obj_06 obj_13 obj_19)
   deleted: (pred_2 obj_19) (pred_3 obj_13 obj_06)
   added: (pred_2 obj_13) (pred_3 obj_19 obj_06)
   goals met: 0 of 3
21. (op_4 obj_06 obj_15)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_15)
   goals met: 0 of 3
22. (op_4 obj_15 obj_22)
   deleted: (pred_6 obj_15)
   added: (pred_6 obj_22)
   goals met: 0 of 3
23. (op_1 obj_22 obj_13)
   deleted: (pred_2 obj_13)
   added: (pred_4) (pred_3 obj_13 obj_22)
   goals met: 1 of 3
24. (op_4 obj_22 obj_10)
   deleted: (pred_6 obj_22)
   added: (pred_6 obj_10)
   goals met: 1 of 3
25. (op_4 obj_10 obj_06)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_06)
   goals met: 1 of 3
26. (op_5 obj_06 obj_19)
   deleted: (pred_3 obj_19 obj_06) (pred_4)
   added: (pred_2 obj_19)
   goals met: 1 of 3
27. (op_4 obj_06 obj_15)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_15)
   goals met: 1 of 3
28. (op_3 obj_15 obj_05 obj_19)
   deleted: (pred_2 obj_19) (pred_3 obj_05 obj_15)
   added: (pred_2 obj_05) (pred_3 obj_19 obj_15)
   goals met: 1 of 3
29. (op_4 obj_15 obj_06)
   deleted: (pred_6 obj_15)
   added: (pred_6 obj_06)
   goals met: 1 of 3
30. (op_4 obj_06 obj_10)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_10)
   goals met: 1 of 3
31. (op_4 obj_10 obj_02)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_02)
   goals met: 1 of 3
32. (op_1 obj_02 obj_05)
   deleted: (pred_2 obj_05)
   added: (pred_4) (pred_3 obj_05 obj_02)
   goals met: 2 of 3
33. (op_4 obj_02 obj_10)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_10)
   goals met: 2 of 3
34. (op_4 obj_10 obj_22)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_22)
   goals met: 2 of 3
35. (op_4 obj_22 obj_15)
   deleted: (pred_6 obj_22)
   added: (pred_6 obj_15)
   goals met: 2 of 3
36. (op_5 obj_15 obj_19)
   deleted: (pred_3 obj_19 obj_15) (pred_4)
   added: (pred_2 obj_19)
   goals met: 2 of 3
37. (op_4 obj_15 obj_22)
   deleted: (pred_6 obj_15)
   added: (pred_6 obj_22)
   goals met: 2 of 3
38. (op_4 obj_22 obj_07)
   deleted: (pred_6 obj_22)
   added: (pred_6 obj_07)
   goals met: 2 of 3
39. (op_4 obj_07 obj_01)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_01)
   goals met: 2 of 3
40. (op_4 obj_01 obj_03)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_03)
   goals met: 2 of 3
41. (op_1 obj_03 obj_19)
   deleted: (pred_2 obj_19)
   added: (pred_4) (pred_3 obj_19 obj_03)
   goals met: 3 of 3
